app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "willimail@gmail.com"]]
---
    	    	redirect_to '/login'
	    	else

                @user = User.find_by_email(params[:session][:email])