app/controllers/users_controller.rb

	def destroy
		if current_user != User.find(params[:id])
	    	User.find(params[:id]).destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]